tap "beeftornado/rmtree"
tap "caskroom/fonts"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "sebglazebrook/aliases"
tap "universal-ctags/universal-ctags"
# Spell checker with better logic than ispell
brew "aspell"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Informative, fancy bash prompt for Git users
brew "bash-git-prompt"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Intelligent archive extraction
brew "dtrx"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils", args: ["with-default-names"]
# Infamous electronic fortune-cookie generator
brew "fortune"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Git extension for versioning large files
brew "git-lfs"
# Find where a commit was merged in git
brew "git-when-merged"
# Command-line option parsing utility
brew "gnu-getopt"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Rainbows and unicorns in your console!
brew "lolcat"
# Package manager for the Lua programming language
brew "luarocks"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Python dependency management tool
brew "pipenv"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Manipulate and query tags on macOS files
brew "tag"
# Programatically correct mistyped console commands
brew "thefuck"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Create screenshots of webpages from the terminal
brew "webkit2png"
# Internet file retriever
brew "wget"
# PDF viewer
brew "xpdf"
# Download YouTube videos from the command-line
brew "youtube-dl"
# New zlib (gzip, deflate) compatible compressor
brew "zopfli"
# It's like cat(1), but for images.
brew "eddieantonio/eddieantonio/imgcat"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "authy"
cask "balenaetcher"
cask "calibre"
cask "chicken"
cask "chromium"
cask "cyberduck"
cask "docker-edge"
cask "firefox"
cask "gitup"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-trends"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "itsycal"
cask "java"
cask "karabiner-elements"
cask "kdiff3"
cask "keybase"
cask "kindle"
cask "marshallofsound-google-play-music-player"
cask "music-manager"
cask "opera"
cask "qlmarkdown"
cask "sequel-pro"
cask "signal"
cask "simplenote"
cask "slack"
cask "spectacle"
cask "steam"
cask "sublime-text"
cask "synology-drive"
cask "the-archive-browser"
cask "the-unarchiver"
cask "ukelele"
cask "visual-studio-code"
cask "vlc"
cask "caskroom/fonts/font-hack-nerd-font"
mas "1Password", id: 443987910
mas "Frank DeLoupe", id: 530458789
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Remote Desktop", id: 715768417
mas "Skitch", id: 425955336
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
