brew "age" # Simple, modern, secure file encryption
brew "asdf" # Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "aspell" # Spell checker with better logic than ispell
brew "awscli" # Official Amazon AWS command-line interface
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "bash-completion", link: false # Programmable completion for Bash 3.2
brew "bash-completion@2", link: false # Programmable completion for Bash 4.2+
brew "bash-git-prompt" # Informative, fancy bash prompt for Git users
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "bats-core" # Bash Automated Testing System
brew "bpytop" # Linux/OSX/FreeBSD resource monitor
brew "coreutils" # GNU File, Shell, and Text utilities
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "direnv" # Load/unload environment variables based on $PWD
brew "exa" # Modern replacement for 'ls'
brew "exiftool" # Perl lib for reading and writing EXIF metadata
brew "expect" # Program that can automate interactive applications
brew "fd" # Simple, fast and user-friendly alternative to find
brew "findutils" # Collection of GNU find, xargs, and locate
brew "fortune" # Infamous electronic fortune-cookie generator
brew "fzf" # Command-line fuzzy finder written in Go
brew "gawk" # GNU awk utility
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-extras" # Small git utilities
brew "git-filter-repo" # Quickly rewrite git repository history
brew "git-lfs" # Git extension for versioning large files
brew "gnu-getopt" # Command-line option parsing utility
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "gnu-tar" # GNU version of the tar archiving utility
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "grep" # GNU grep, egrep and fgrep
brew "hub" # Add GitHub support to git on the command-line
brew "hyperfine" # Command-line benchmarking tool
brew "jq" # Lightweight and flexible command-line JSON processor
brew "jrnl", link: false # Command-line note taker
brew "jrnl-org/prerelease/jrnl-beta" # Command-line note taker
brew "koekeishiya/formulae/yabai" # A tiling window manager for macOS based on binary space partitioning.
brew "kryptco/tap/kr" # Krypton command-line client, daemon, and SSH integration
brew "lolcat" # Rainbows and unicorns in your console!
brew "luajit", args: ["HEAD"] # Just-In-Time Compiler (JIT) for the Lua programming language
brew "luarocks" # Package manager for the Lua programming language
brew "mas" # Mac App Store command-line interface
brew "micro" # Modern and intuitive terminal-based text editor
brew "moreutils" # Collection of tools that nobody wrote when UNIX was young
brew "n" # Node version management
brew "neovim", args: ["HEAD"] # Ambitious Vim-fork focused on extensibility and agility
brew "nmap" # Port scanning utility for large networks
brew "openssh" # OpenBSD freely-licensed SSH connectivity tools
brew "p7zip" # 7-Zip (high compression file archiver) implementation
brew "pandoc" # Swiss-army knife of markup format conversion
brew "perl" # Highly capable, feature-rich programming language
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "poetry" # Python package management tool
brew "postgresql@11", restart_service: true # Object-relational database system
brew "prettyping" # Wrapper to colorize and simplify ping's output
brew "pyenv" # Python version management
brew "pyenv-virtualenv" # Pyenv plugin to manage virtualenv
brew "python@3.8" # Interpreted, interactive, object-oriented programming language
brew "qmk/qmk/qmk" # Quantum Mechanical Keyboard (QMK) Firmware
brew "redis", restart_service: true # Persistent key-value database, with built-in net interface
brew "rename" # Perl-powered file rename script with many helpful built-ins
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "rsync" # Utility that provides fast incremental file transfer
brew "ruby" # Powerful, clean, object-oriented scripting language
brew "ruby@2.7" # Powerful, clean, object-oriented scripting language
brew "secrethub/tools/secrethub-cli" # Command-line interface for SecretHub
brew "sheldon" # Fast, configurable, shell plugin manager
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "showkey" # Simple keystroke visualizer
brew "sops" # Editor of encrypted files
brew "sox" # SOund eXchange: universal sound sample translator
brew "tag" # Manipulate and query tags on macOS files
brew "terraform@0.13" # Tool to build, change, and version infrastructure
brew "tmux", args: ["HEAD"] # Terminal multiplexer
brew "trash" # CLI tool that moves files or folder to the trash
brew "util-linux" # Collection of Linux utilities
brew "webkit2png" # Create screenshots of webpages from the terminal
brew "wget" # Internet file retriever
brew "youtube-dl" # Download YouTube videos from the command-line
brew "yq" # Process YAML documents from the CLI
brew "zplug" # Next-generation plugin manager for zsh
brew "zsh" # UNIX shell (command interpreter)
cask "1password" # Password manager that keeps all passwords secure behind one password
cask "adobe-creative-cloud" # Collection of apps and services for photography, design, video, web, and UX
cask "alacritty" # GPU-accelerated terminal emulator
cask "alfred" # Application launcher and productivity software
cask "amethyst" # Automatic tiling window manager similar to xmonad
cask "audio-hijack" # Records audio from any application
cask "chromium" # Free and open-source web browser
cask "cyberduck" # Server and cloud storage browser
cask "discord" # Voice and text chat software
cask "docker" # App to build and share containerized applications and microservices
cask "epic-games" # Launcher for *Epic Games* games
cask "farrago" # Audio playback
cask "firefox" # Web browser
cask "fission" # Audio editor
cask "flux" # Screen color temperature controller
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "gitup" # Git interface focused on visual interaction
cask "google-backup-and-sync"
cask "google-chrome" # Web browser
cask "google-trends"
cask "itsycal" # Menu bar calendar
cask "karabiner-elements" # Keyboard customizer
cask "kitty" # GPU-based terminal emulator
cask "logitech-camera-settings" # Provides access to camera controls
cask "loopback" # Cable-free audio router
cask "meld" # Visual diff and merge tool
cask "obs" # Open-source software for live streaming and screen recording
cask "pandora" # Desktop client for the Pandora web radio service
cask "postman" # Collaboration platform for API development
cask "qlimagesize" # Display image info and preview unsupported formats in QuickLook
cask "qlmarkdown" # QuickLook generator for Markdown files
cask "qlvideo"
cask "qmk-toolbox" # Toolbox companion for QMK Firmware
cask "qview"
cask "sequel-pro" # MySQL/MariaDB database management platform
cask "signal" # Instant messaging application focusing on security
cask "skitch" # Screen capture tool with mark up and sharing features
cask "slack" # Team communication and collaboration software
cask "sourcetree" # Graphical client for Git version control
cask "spectacle" # Move and resize windows with ease
cask "steam" # Video game digital distribution service
cask "tableplus" # Native GUI tool for relational databases
cask "the-archive-browser"
cask "the-unarchiver" # Unpacks archive files
cask "transmission" # Open-source BitTorrent client
cask "vlc" # Multimedia player
cask "webpquicklook"
cask "zoom" # Video communication and virtual meeting platform
cask "zsa-wally" # Flash tool for ZSA keyboards
mas "Skitch", id: 425955336
mas "Xcode", id: 497799835
